#include <iostream>
#include <Windows.h>
using namespace std;

// Створюємо змінні, що зберігатимуть розміри масиву
const int m = 3, n = 3;

// Функція, що знаходить і виводить суму елементів головної та побічної діагоналей масиву
void sum(int arr[m][n]) {
	// Створюємо змінні, що зберігатимуть суму чисел головної та побічної діагоналі відповідно
	int mainDiagSum = 0, diagSum = 0;

	// Знаходимо суми
	for (int i = 0; i < m; i++) {
		mainDiagSum += arr[i][i];
		diagSum += arr[m - i - 1][i];
	}

	// Виводимо результат
	cout << "Сума елементів головної діагоналі: " << mainDiagSum << endl;
	cout << "Сума елементів побічної діагоналі: " << diagSum << endl;
}

int main() {
	// Встановлюємо кодування виводу консолі для коректного відображення кирилиці
	SetConsoleOutputCP(1251);
	// Встановлюємо насіння для функції rand() рівним теперішньому часу
	srand(time(0));

	// Створюємо масив та його копію
	int arr[m][n];
	int copy[m][n];

	// Заповнюємо масив та його копію випадковими числами від 0 до 9 та одразу виводимо значення його елементів
	cout << "Початковий масив:\n";
	for (int i = 0; i < m; i++) {
		for (int j = 0; j < n; j++) {
			int num = rand() % 10;
			arr[i][j] = num;
			copy[i][j] = num;
			cout << arr[i][j] << " ";
		}
		cout << endl;
	}

	// За допомогою функції знаходимо і виводимо суми чисел діагоналей
	sum(arr);

	// "Повертаємо" масив на 90 градусів за годинниковою стрілкою 
	for (int i = 0; i < m; i++) {
		for (int j = 0; j < n; j++) {
			arr[i][j] = copy[m - 1 - j][i];
		}
	}

	// Виводимо повернутий масив
	cout << "Масив, повернутий на 90 градусів за годинниковою стрілкою:\n";
	for (int i = 0; i < m; i++) {
		for (int j = 0; j < n; j++) {
			cout << arr[i][j] << " ";
		}
		cout << endl;
	}
	
	system("pause");
}